{"name":"VIJAY BALAJI S","headerTaglineOne":"Hello 👋","headerTaglineTwo":"vijay balaji","headerTaglineThree":"devops engineer","headerTaglineFour":"Coimbatore, India","showCursor":false,"showBlog":false,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":""},{"id":"2","title":"LinkedIn","link":""},{"id":"5","title":"Email","link":""}],"projects":[{"id":"1","title":"Sonic-Safe-ANC-Industrial-Solution-Project","description":"Electronics","imageSrc":"","url":""},{"id":"2","title":"Practice-Page-Web-AutomationPublic","description":"Selenium Testing","imageSrc":"","url":""},{"id":"3","title":"BlogVista","description":"Design","imageSrc":"https://images.unsplash.com/photo-1504083898675-c896ecdae86e?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxzZWFyY2h8MjJ8fHBhc3RlbHxlbnwwfHwwfA%3D%3D&auto=format&fit=crop&w=400&q=60","url":""}],"services":[{"id":"1","title":"UI / UX Design","description":"Proficient in UI design with Figma, crafting intuitive interfaces for enhanced user experiences. Experienced in leveraging UI/UX principles to create engaging designs that prioritize user satisfaction and ease of navigation."},{"id":"2","title":"Selenium Testing","description":"Experienced in Selenium WebDriver for comprehensive web application testing, ensuring robust functionality and user experience. Proficient in crafting Selenium automation scripts to conduct thorough testing, ensuring the reliability and efficiency of web applications."},{"id":"4","title":"Java","description":"Utilize Java for both testing and problem-solving needs. Explore efficient algorithms, data structures, and practical solutions for coding challenges, along with testing methodologies tailored for Java applications."}],"aboutpara":"I am proficient in UI design, utilizing Figma for creating intuitive interfaces. My expertise extends to Selenium WebDriver for comprehensive web application testing. Additionally, I possess hands-on experience in Tinkercad for designing and simulating electronic circuits, particularly for IoT systems. Currently, I am expanding my skills in embedded systems while actively enhancing my proficiency in Selenium testing and UI design. I am eager to collaborate on projects that demand innovative solutions and foster teamwork. Moreover, I am seeking opportunities to gain more hands-on experience across diverse areas, including testing, design, and electronics.","resume":{"tagline":"👋  I'm a software engineer, product designer.","description":"I have delivered world-class user experiences to millions of people. Well-versed with React, Javascript, and most of the Web frameworks.","experiences":[{"id":"1","dates":"","type":"","position":"","bullets":""},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"","type":"","position":"","bullets":""}],"education":{"universityName":"Karpagam Institute of Technology","universityDate":"2021-2025","universityPara":"I am currently pursuing a B.E. in Electronics and Communication Engineering at Karpagam Institute of Technology. UI Design, Selenium Testing"},"languages":["Java","Python"],"frameworks":[],"others":["Figma","Canva","AWS"]}}
